Revit 2026 API

# RailingFlipped Property

---

Indicates if the railing is flipped.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Flipped { get; }
```
```vb
Public ReadOnly Property Flipped As Boolean
	Get
```
```cpp
public:
property bool Flipped {
	bool get ();
}
```
```fsharp
member Flipped : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The railing has incorrect internal data. |

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace